EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
#if 0
			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING(param);
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING(cmd);
			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
#endif
			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM2();
			ESOS_TASK_WAIT_ON_SEND_UINT82(0xAA); 		// send byte to FPGA
			ESOS_TASK_WAIT_TICKS(TEMP_DELAY3);

			ESOS_TASK_WAIT_ON_SEND_UINT82(0x55);
			ESOS_TASK_WAIT_TICKS(TEMP_DELAY3);

			ESOS_TASK_WAIT_ON_SEND_UINT82(param);
			ESOS_TASK_WAIT_TICKS(TEMP_DELAY3);

			ESOS_TASK_WAIT_ON_SEND_UINT82(cmd);
			ESOS_TASK_WAIT_TICKS(TEMP_DELAY3);

			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM2();
        }
    }
    ESOS_TASK_END();
}
#if 0
#define   CONFIG_SLAVE_ENABLE() CONFIG_RF5_AS_DIG_OUTPUT()
#define   SLAVE_ENABLE()        LATFbits.LATF5 = 0
#define   SLAVE_DISABLE()       LATFbits.LATF5 = 1
#endif

//#define   CONFIG_SLAVE2_ENABLE() CONFIG_RG8_AS_DIG_OUTPUT()
//#define   SLAVE2_ENABLE()        LATGbits.LATG8 = 0
//#define   SLAVE2_DISABLE()       LATGbits.LATG8 = 1

//******************************************************************************************//
//********************************** CONFIG_SPI_SLAVE **************************************//
//******************************************************************************************//
static void CONFIG_SPI_SLAVE(void)
{
  SPI1CON1 = SEC_PRESCAL_8_1		|		//8:1 secondary prescale
             PRI_PRESCAL_64_1		|		//64:1 primary prescale
             CLK_POL_ACTIVE_HIGH	|		//clock active high (CKP = 0)
             SPI_CKE_ON				|		//out changes active to idle (CKE=1)
             SPI_MODE8_ON			|		//8-bit mode
//             SPI_SMP_ON				|		// input data sampled at end of data output time
             SLAVE_ENABLE_ON;				//master mode

	CONFIG_SDI1_TO_RP(RD14_RP);
	CONFIG_RD14_AS_DIG_INPUT();
	CONFIG_SDO1_TO_RP(RD15_RP);
	CONFIG_RD15_AS_DIG_OUTPUT();
	CONFIG_SCK1IN_TO_RP(RF4_RP);
	CONFIG_RF4_AS_DIG_INPUT();
	CONFIG_SS1IN_TO_RP(RF5_RP);
	CONFIG_RF5_AS_DIG_INPUT();
	SPI1STATbits.SPIEN = 1;  //enable SPI mode
}
volatile uint8_t  cmd_array[24] = {0x80, 0x81, 0x82, 0x83, 0x84, 0x85, 0x86, 0x87, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15};
//******************************************************************************************//
//**************************************** echo_spi ****************************************//
//******************************************************************************************//
ESOS_USER_TASK(echo_spi_task)
{
	static uint8_t data1;
	static uint8_t data2;
	static uint8_t cmd;
	static uint8_t i;

//	static char rpm_disp[5];
//	static char mph_disp[5];
//	static uint16_t res;
	static res2;
//	static uint16_t res3, res4;
//	static char res_str[10];
//	static char res2_str[10];

	static uint8_t  res_array[24];

    ESOS_TASK_BEGIN();

//#if 0
	ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
    ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
    ESOS_TASK_WAIT_ON_SEND_UINT8('\r');
    ESOS_TASK_WAIT_ON_SEND_STRING("echo_spi_task on comm1");
    ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
    ESOS_TASK_WAIT_ON_SEND_UINT8('\r');
	ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
	ESOS_TASK_SIGNAL_AVAILABLE_SPI();
//#endif


	data1 = 0x21;		
    while(TRUE)
	{
			
//		ESOS_TASK_WAIT_TICKS(TDELAY2);
//#if 0
		for(i = 0;i < 24;i++)
		{
			cmd = cmd_array[i];
			ESOS_TASK_WAIT_ON_AVAILABLE_SPI();
			ESOS_TASK_WAIT_ON_READ1SPI1(data1);
			ESOS_TASK_WAIT_ON_WRITE1SPI1(cmd);
			ESOS_TASK_SIGNAL_AVAILABLE_SPI();
			
			if(res_array[i] != data1)
			{
				ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
				ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING(i);
				ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
			}
			res_array[i] = data1;

			if(i == 0)
				ESOS_TASK_WAIT_TICKS(TDELAY2);
			res2++;
			if((res2 % 300) == 0)
			{
				ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
				ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((uint8_t)(res2>>8));
//				ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
//				ESOS_TASK_WAIT_ON_SEND_UINT8('\r');
				ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
			}

#if 0
			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
			if(i == 2)
			{
				ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
				ESOS_TASK_WAIT_ON_SEND_UINT8('\r');
			}
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING(data1);
	//        ESOS_TASK_WAIT_ON_SEND_UINT8(data2);
		    ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();

			switch(i)
			{
				case 2:
					rpm_disp[0] = data1 + 0x30;
					break;
				case 3:
					rpm_disp[1] = data1 + 0x30;
					break;
				case 4:
					rpm_disp[2] = data1 + 0x30;
					break;
				case 5:
					rpm_disp[3] = data1 + 0x30;
					break;
				case 6:
					mph_disp[0] = data1 + 0x30;
					break;
				case 7:
					mph_disp[1] = data1 + 0x30;
					break;
				case 8:
					mph_disp[2] = data1 + 0x30;
					break;
				case 9:
					mph_disp[3] = data1 + 0x30;
					res = res2 = 0;
					res3 = res4 = 0;
					break;

				case 10:
					res = (uint16_t)data1;
	//					printf("%2x\t",res);
					break;
				case 11:
					res2 = (uint16_t)data1;
	//					printf("%2x\t",res2);
					res2 <<= 8;
					res2 &= 0xff00;
					res |= res2;
					break;
				case 12:
					res3 = data1;
					break;
				case 13:
					res4 = data1;
					res4 <<= 8;
					res4 &= 0xff00;
					res3 |= res4;
					break;
				case 15:	
					ESOS_TASK_WAIT_ON_SEND_STRING(rpm_disp);
					ESOS_TASK_WAIT_ON_SEND_UINT8('\t');
					ESOS_TASK_WAIT_ON_SEND_STRING(mph_disp);
					ESOS_TASK_WAIT_ON_SEND_UINT8('\t');
					sprintf(res_str,"%4d",res);
					sprintf(res2_str,"%4d",res2);
					ESOS_TASK_WAIT_ON_SEND_STRING(res);
					ESOS_TASK_WAIT_ON_SEND_UINT8('\t');
					ESOS_TASK_WAIT_ON_SEND_STRING(res2);
					ESOS_TASK_WAIT_ON_SEND_UINT8('\t');
					break;
			}	
#endif
		}
    }
    ESOS_TASK_END();
}
//#if 0
static void diy_sprintf(char *str,uint16_t num)
{
	int i;
	uint16_t num2,num3,num4,num5,num6;

	for(i = 0;i < 6;i++)
		str[i] = 0x20;
	str[5] = 0;

//	printf("num (int): %d\n",num);

	num2 = num;
	num2 /= 10;
	num2 *= 10;

	num3 = num;
	num3 /= 100;
	num3 *= 100;

	num4 = num;
	num4 /= 1000;
	num4 *= 1000;

	num5 = num;
	num5 /= 10000;
	num5 *= 10000;

	num6 = num;
	num6 /= 100000;
	num6 *= 100000;

	num6 = num5 - num6;
	num5 = num4 - num5;
	num4 = num3 - num4;
	num3 = num2 - num3;
	num2 = num - num2;

	num6 /= 10000;
	num5 /= 1000;
	num4 /= 100;
	num3 /= 10;

//	printf("num separated into ints: %d %d %d %d %d\n",num6,num5,num4,num3,num2);	// 2 3 4 5 6

	str[4] = num2 + 0x30;
	str[3] = num3 + 0x30;
	str[2] = num4 + 0x30;
	str[1] = num5 + 0x30;
	str[0] = num6 + 0x30;

	i = 0;
	while(str[i] == '0')
	{
		str[i] = 0x20;
		i++;
	}
}
//#endif
//******************************************************************************************//
//*************************************** comm1_task ***************************************//
//******************************************************************************************//
// comm1_task - uses comm1 - wait for char from comm1
ESOS_USER_TASK(comm1_task)
{
    static  uint8_t data1, data2;
    static  uint8_t temp;
    static	uint16_t temp2;
    static int first_glitch = 0;
    char str[7];
//    static ESOS_TASK_HANDLE h_Task3;

    ESOS_TASK_BEGIN();

	ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
    ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
    ESOS_TASK_WAIT_ON_SEND_UINT8('\r');
    ESOS_TASK_WAIT_ON_SEND_STRING("comm1_task on comm1");
    ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
    ESOS_TASK_WAIT_ON_SEND_UINT8('\r');
	ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
/*
	ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM2();
    ESOS_TASK_WAIT_ON_SEND_UINT82('\n');
    ESOS_TASK_WAIT_ON_SEND_UINT82('\r');
    ESOS_TASK_WAIT_ON_SEND_STRING2("comm1_task on comm2");
    ESOS_TASK_WAIT_ON_SEND_UINT82('\n');
    ESOS_TASK_WAIT_ON_SEND_UINT82('\r');
	ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM2();
*/
//	data = 0x21;
	data1 = 0x21;
	data2 = 0x30;
	temp2 = 1000;
	while(TRUE)
    {
		// wait for input from comm1
/*
        ESOS_TASK_WAIT_ON_AVAILABLE_IN_COMM();
        ESOS_TASK_WAIT_ON_GET_UINT8(data2);
        ESOS_TASK_SIGNAL_AVAILABLE_IN_COMM();
*/
		// send data1 to FPGA
		if(++data1 > 0x7e)
			data1 = 0x21;

//        ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM2();
//        ESOS_TASK_WAIT_ON_SEND_UINT82(data1);
//        ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM2();

//		ESOS_TASK_WAIT_TICKS(TDELAY2);

		// read what's sent back into data2
//        ESOS_TASK_WAIT_ON_AVAILABLE_IN_COMM2();
//        ESOS_TASK_WAIT_ON_GET_UINT82(data2);
//        ESOS_TASK_SIGNAL_AVAILABLE_IN_COMM2();

//		ESOS_TASK_WAIT_TICKS(TDELAY);


//        if(++data1 > 0x7e)
//        	data1 = 0x21;

