EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
        if(++data2 > 0x7e)
        	data2 = 0x21;

		// report what's sent back to comm1 (linux box monitor)
        ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
/*
        if((data2 < 0x20 || data2 > 0x7e) && first_glitch)
        {
			ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
			ESOS_TASK_WAIT_ON_SEND_UINT8('\r');
    		ESOS_TASK_WAIT_ON_SEND_STRING("glitch: ");
            ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING(data2);
			ESOS_TASK_WAIT_TICKS(2000);
			ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
			ESOS_TASK_WAIT_ON_SEND_UINT8('\r');
		} 
        else
	        ESOS_TASK_WAIT_ON_SEND_UINT8(data2);
*/
        if(++temp == 93)
//        if(data2 >= 0x1f)
        {
			ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
			ESOS_TASK_WAIT_ON_SEND_UINT8('\r');
			temp = 0;
			temp2++;
        }
//        ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING(data2);
//		ESOS_TASK_WAIT_ON_GET_UINT8(data2);
//		ESOS_TASK_WAIT_ON_SEND_UINT8(data2);
//		data2++;
//		ESOS_TASK_WAIT_ON_SEND_UINT8(data2);
		temp2 += 10;
		if(temp2 > 32767)
			temp2 = 0;
		diy_sprintf(str,temp2);
//		sprintf(str,"%6d",temp2++);
   		ESOS_TASK_WAIT_ON_SEND_STRING(str);
		ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
		ESOS_TASK_WAIT_ON_SEND_UINT8('\r');
        ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
        
		ESOS_TASK_WAIT_TICKS(5);

	}
//    h_Task3 = esos_GetTaskHandle(task3);
//        ESOS_TASK_WAIT_FOR_MAIL();
//        while(ESOS_TASK_IVE_GOT_MAIL())
/*
	while(TRUE)
    {
        ESOS_TASK_WAIT_ON_AVAILABLE_IN_COMM();
        ESOS_TASK_WAIT_ON_GET_UINT8(data);
        ESOS_TASK_SIGNAL_AVAILABLE_IN_COMM();

        ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM3();
        ESOS_TASK_WAIT_ON_SEND_UINT83(data);
        ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM3();
    } // endof while()
*/
    ESOS_TASK_END();
}
//******************************************************************************************//
//*************************************** comm3_task ***************************************//
//******************************************************************************************//
// just echo what's sent from AVR to comm1 (for debugging)
ESOS_USER_TASK(comm3_task)
{
    static  uint8_t data;
    static  uint8_t data2;
    static	uint8_t dec;
//    static ESOS_TASK_HANDLE h_Task3;

    ESOS_TASK_BEGIN();
	ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
    ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
    ESOS_TASK_WAIT_ON_SEND_UINT8('\r');
    ESOS_TASK_WAIT_ON_SEND_STRING("comm3_task");
	ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();


	data = 0x21;
	data2 = 0;
    while (1)
    {
		ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM2();
		ESOS_TASK_WAIT_ON_SEND_UINT82(data);
		ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM2();

		if(++data2 > 0x0f)
			data2 = 0;

		ESOS_TASK_WAIT_TICKS(TDELAY2/2);

        ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
        ESOS_TASK_WAIT_ON_SEND_UINT8(data);
        ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
        if(++data > 0x7e)
        	data = 0x21;
    } // endof while()
    ESOS_TASK_END();
}

#define NUM_CHANNELS 2
volatile uint16_t au16_buffer[NUM_CHANNELS];
volatile uint8_t  u8_waiting;

//******************************************************************************************//
//**************************************** convADC  ****************************************//
//******************************************************************************************//
ESOS_USER_TASK(convADC)
{
    static  uint8_t data1, u8_wdtState;
	static uint16_t u16_adcVal1, u16_adcVal2;
	static float f_adcVal;
	static uint8_t   u8_i;
	static uint16_t  u16_pot;

    ESOS_TASK_BEGIN();

	ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
	ESOS_TASK_WAIT_ON_SEND_STRING("starting ADC task\r\n");
	ESOS_TASK_WAIT_ON_SEND_STRING("                                 \r");
	ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();

	CONFIG_RB0_AS_ANALOG();
	CONFIG_RB1_AS_ANALOG();

	configADC1_AutoScanIrqCH0( ADC_SCAN_AN0 | ADC_SCAN_AN1, 31, 0);
	while ( !AD1CON1bits.DONE)
		ESOS_TASK_WAIT_TICKS(1);

	while (TRUE)
	{
		while (u8_waiting)	// wait for valid data in ISR
			ESOS_TASK_WAIT_TICKS(1);
		u8_waiting = 0;
		for ( u8_i=0; u8_i<NUM_CHANNELS; u8_i++)
		{
			u16_pot = au16_buffer[u8_i];

			ESOS_TASK_WAIT_ON_AVAILABLE_OUT_COMM();
			if(u8_i == 0)
			{
//				ESOS_TASK_WAIT_ON_SEND_UINT8('\n');
				ESOS_TASK_WAIT_ON_SEND_UINT8('\r');
			}
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((uint8_t)(u16_pot>>8));
			ESOS_TASK_WAIT_ON_SEND_UINT8_AS_HEX_STRING((uint8_t)u16_pot);
			ESOS_TASK_WAIT_TICKS(50);
			ESOS_TASK_SIGNAL_AVAILABLE_OUT_COMM();
		}
	}
	ESOS_TASK_END();
}
//******************************************************************************************//
//************************************ ACD1Interrupt  **************************************//
//******************************************************************************************//
void _ISR _ADC1Interrupt (void)
{
	uint8_t			u8_i;
	uint16_t*		au16_adcHWBuff = (uint16_t*) &ADC1BUF0;

	for ( u8_i=0; u8_i<NUM_CHANNELS; u8_i++)
	{
		au16_buffer[u8_i] = au16_adcHWBuff[u8_i];
	} //end for()
	u8_waiting = 0;  // signal main() that data is ready
	_AD1IF = 0;   //clear the interrupt flag
}

/*
static void strcpy2(char *str1, char *str2)
{
	int i = 0;
	do
	{
		str1[i] = str2[i];
		i++;

	}while(str2[i] != 0);
}
*/
//******************************************************************************************//
//**************************************** disp_pstate *************************************//
//******************************************************************************************//
// PIC24_aux_states (main.h)
static void disp_pstate(UCHAR state, char *str)
{
	switch (state)
	{
		case IDLE_AUX:
			strcpy(str,"IDLE_AUX\0");
			break;
		case DATA_REQ:
			strcpy(str,"DATA_REQ\0");
			break;
		case VALID_DATA:
			strcpy(str,"VALID_DATA\0");
			break;
		case DATA_READY:
			strcpy(str,"DATA_READY\0");
			break;
		case EXTRA:
			strcpy(str,"EXTRA\0");
			break;
		default:
			strcpy(str,"<bad state>\0");
			break;
	}
}
//******************************************************************************************//
//************************************** disp_auxcmd ***************************************//
//******************************************************************************************//
static void disp_auxcmd(UCHAR state, char *str)
{
	switch (state)
	{
		case CMD_GET_DATA:
			strcpy(str,"CMD_GET_DATA\0");
			break;
		case CMD_DATA_READY:
			strcpy(str,"CMD_DATA_READY\0");
			break;
		case CMD_NEW_DATA:
			strcpy(str,"CMD_NEW_DATA\0");
			break;
		case CMD_EXTRA:
			strcpy(str,"CMD_EXTRA\0");
			break;
		default:
		strcpy(str,"<bad cmd>\0");
		break;
	}
}
//******************************************************************************************//
//************************************* CONFIG_SPI2 ****************************************//
//******************************************************************************************//
#if 0
CONFIG_SPI2()
{
#if 0
  SPI1CON1 = SEC_PRESCAL_1_1		|		//1:1 secondary prescale	40MHz
             PRI_PRESCAL_4_1		|		//4:1 primary prescale
             CLK_POL_ACTIVE_HIGH	|		//clock active high (CKP = 0)
             SPI_CKE_ON				|		//out changes active to idle (CKE=1)
             SPI_MODE8_ON			|		//8-bit mode
             MASTER_ENABLE_ON;				//master mode
#endif
//#if 0
  SPI2CON1 = SEC_PRESCAL_8_1		|		//8:1 secondary prescale
             PRI_PRESCAL_64_1		|		//64:1 primary prescale
             CLK_POL_ACTIVE_HIGH	|		//clock active high (CKP = 0)
             SPI_CKE_ON				|		//out changes active to idle (CKE=1)
             SPI_MODE8_ON			|		//8-bit mode
             MASTER_ENABLE_ON;				//master mode
//#endif
//	SPI1CON2 = FRAME_ENABLE_ON | FRAME_SYNC_OUTPUT | FRAME_SYNC_ACTIVE_LOW | SPI_FRM_PULSE_PREV_CLK;
//	SPI1CON2 = FRAME_ENABLE_ON | FRAME_SYNC_OUTPUT | FRAME_SYNC_ACTIVE_LOW | SPI_FRM_PULSE_FIRST_CLK;
//	SPI1CON2 = FRAME_ENABLE_ON | FRAME_SYNC_OUTPUT | FRAME_SYNC_ACTIVE_HIGH;
/*
pin 47	RD14	RPI42	MISO	(input)
pin 48	RD15	RP5		MOSI	(output)
pin 49	RF4		RP10	SCLK	(output)
pin 50	RF5		RP17	SS		(output)
*/
	CONFIG_SDI2_TO_RP(RC1_RP);
	CONFIG_RC1_AS_DIG_INPUT();
	CONFIG_SDO2_TO_RP(RG6_RP);
	CONFIG_RG6_AS_DIG_OUTPUT();
	CONFIG_SCK2OUT_TO_RP(RG7_RP);
	CONFIG_RG7_AS_DIG_OUTPUT();
//	CONFIG_SS2OUT_TO_RP(RG8_RP);
	CONFIG_RG8_AS_DIG_OUTPUT();
	SLAVE2_DISABLE();
	SPI2STATbits.SPIEN = 1;  //enable SPI mode
	
