EmbeddedSystemClass/Truck_Project1/PIC24_support/esos1/Truck_App.h
}
//******************************************************************************************//
//**************************************** echo_spi ****************************************//
//******************************************************************************************//
ESOS_USER_TASK(fast_echo_spi_task)
{
	static uint8_t data3;
    ESOS_TASK_BEGIN();
	ESOS_TASK_SIGNAL_AVAILABLE_SPI();

	data3 = 0xaa;
	
    while(TRUE)
	{
	    ESOS_TASK_WAIT_ON_AVAILABLE_SPI();
	    SLAVE_ENABLE();
	    ESOS_TASK_WAIT_ON_WRITE1SPI1(data3);
		SLAVE_DISABLE();
		ESOS_TASK_SIGNAL_AVAILABLE_SPI();
		ESOS_TASK_WAIT_TICKS(1);

/*
	    ESOS_TASK_WAIT_ON_AVAILABLE_SPI();
	    SLAVE2_ENABLE();
	    ESOS_TASK_WAIT_ON_WRITE1SPI2(data3);
		SLAVE2_DISABLE();
		ESOS_TASK_SIGNAL_AVAILABLE_SPI();
		ESOS_TASK_WAIT_TICKS(1);
*/
    }
    ESOS_TASK_END();
}
//******************************************************************************************//
//************************************** CONFIG_SPI ****************************************//
//******************************************************************************************//
CONFIG_SPI_MASTER()
{
#if 0
  SPI1CON1 = SEC_PRESCAL_1_1		|		//1:1 secondary prescale	40MHz
             PRI_PRESCAL_4_1		|		//4:1 primary prescale
             CLK_POL_ACTIVE_HIGH	|		//clock active high (CKP = 0)
             SPI_CKE_ON				|		//out changes active to idle (CKE=1)
             SPI_MODE8_ON			|		//8-bit mode
             MASTER_ENABLE_ON;				//master mode
#endif
//#if 0
  SPI1CON1 = SEC_PRESCAL_8_1		|		//8:1 secondary prescale
             PRI_PRESCAL_64_1		|		//64:1 primary prescale
             CLK_POL_ACTIVE_HIGH	|		//clock active high (CKP = 0)
             SPI_CKE_ON				|		//out changes active to idle (CKE=1)
             SPI_MODE8_ON			|		//8-bit mode
//             SPI_SMP_ON				|		// input data sampled at end of data output time
             MASTER_ENABLE_ON;				//master mode
//#endif
//	SPI1CON2 = FRAME_ENABLE_ON | FRAME_SYNC_OUTPUT | FRAME_SYNC_ACTIVE_LOW | SPI_FRM_PULSE_PREV_CLK;
//	SPI1CON2 = FRAME_ENABLE_ON | FRAME_SYNC_OUTPUT | FRAME_SYNC_ACTIVE_LOW | SPI_FRM_PULSE_FIRST_CLK;
//	SPI1CON2 = FRAME_ENABLE_ON | FRAME_SYNC_OUTPUT | FRAME_SYNC_ACTIVE_HIGH;
/*
pin 47	RD14	RPI42	MISO	(input)
pin 48	RD15	RP5		MOSI	(output)
pin 49	RF4		RP10	SCLK	(output)
pin 50	RF5		RP17	SS		(output)
*/
	CONFIG_SDI1_TO_RP(RD14_RP);
	CONFIG_RD14_AS_DIG_INPUT();
	CONFIG_SDO1_TO_RP(RD15_RP);
	CONFIG_RD15_AS_DIG_OUTPUT();
	CONFIG_SCK1OUT_TO_RP(RF4_RP);
	CONFIG_RF4_AS_DIG_OUTPUT();
	CONFIG_SS1OUT_TO_RP(RF5_RP);
	CONFIG_RF5_AS_DIG_OUTPUT();
	SPI1STATbits.SPIEN = 1;  //enable SPI mode
}
#endif

